# объявление функции
def number_to_words(num):
    numbers = ["ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
    numbers_10 = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
                  "семнадцать", "восемнадцать", "девятнадцать"]
    numbers_20 = ["ничего", "ничего", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят",
                  "восемьдесят", "девяносто"]

    if num < 10:
        return numbers[num]
    if 10 <= num < 20:
        return numbers_10[num - 10]
    if 20 <= num < 100:
        b = num % 10
        a = (num % 100) // 10
        if b == 0:
            return numbers_20[a]
        else:
            str_a = numbers_20[a]
            str_b = numbers[b]
            return (str_a + ' ' + str_b)


# считываем данные
n = int(input())

# вызываем функцию
print(number_to_words(n))
